Revit 2027 API
ExportFontTable.Remove Method
 Removes the pair (key, info) by font key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Remove(
	ExportFontKey exportFontKey
)
Public Sub Remove (
	exportFontKey As ExportFontKey
)
public:
void Remove(
	ExportFontKey^ exportFontKey
)
member Remove :
        exportFontKey : ExportFontKey -> unit
Parameters
exportFontKey ExportFontKey
 The export font key.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportFontTable Class
Autodesk.Revit.DB Namespace